* Some experiments to see if we can use maxima

#+BEGIN_SRC maxima :session :results raw
m: [2*x - (a - 1)*y = 5*b, c + b*y + a*x = 0]$
print(augcoefmatrix (m, [x, y]));
#+END_SRC

#+RESULTS:
[ 2  1 - a  - 5 b ]
[                 ] 
[ a    b      c   ]


#+name: test-maxima
#+header: :exports results
#+header: :var x=1.3121254
#+begin_src maxima 
  programmode: false;
  print(12^x);
#+end_src

#+RESULTS: test-maxima
: 26.06280316745401


#+BEGIN_SRC maxima :session :results raw replace drawer
m: [ y(1,1) +2*y(1,2)-x1 = 0,
  y(1,0) + y(1,1) + y(1,2) = 1,
  y(2,1) +2*y(2,2)-x2 = 0,
  y(2,0) + y(2,1) + y(2,2) = 1,
  y(1,2) + y(2,2) = 1]$
print(augcoefmatrix (m, [x1, x2, y(1,0), y(1,1), y(1,2), y(2,0), y(2,1), y(2,2)]));
#+END_SRC

#+RESULTS:
:RESULTS:
[ - 1   0   0  1  2  0  0  0   0  ]
[                                 ]
[  0    0   1  1  1  0  0  0  - 1 ]
[                                 ]
[  0   - 1  0  0  0  0  1  2   0  ] 
[                                 ]
[  0    0   0  0  0  1  1  1  - 1 ]
[                                 ]
[  0    0   0  0  1  0  0  1  - 1 ]
:END:

* at_least_4(x_1,...,x_6) = 3  ; x_i in [0,..,5]
#+BEGIN_SRC maxima :session :results raw replace drawer
  m: [
    y\(1\,0\) + y\(1\,1\) + y\(1\,2\) + y\(1\,3\) + y\(1\,4\) + y\(1\,5\) = 1,
    y\(2\,0\) + y\(2\,1\) + y\(2\,2\) + y\(2\,3\) + y\(2\,4\) + y\(2\,5\) = 1,
    y\(3\,0\) + y\(3\,1\) + y\(3\,2\) + y\(3\,3\) + y\(3\,4\) + y\(3\,5\) = 1,
    y\(4\,0\) + y\(4\,1\) + y\(4\,2\) + y\(4\,3\) + y\(4\,4\) + y\(4\,5\) = 1,
    y\(5\,0\) + y\(5\,1\) + y\(5\,2\) + y\(5\,3\) + y\(5\,4\) + y\(5\,5\) = 1,
    y\(6\,0\) + y\(6\,1\) + y\(6\,2\) + y\(6\,3\) + y\(6\,4\) + y\(6\,5\) = 1,
   y\(1\,1\) +2*y\(1\,2\) +3*y\(1\,3\) +4*y\(1\,4\) +5*y\(1\,5\)-x1 = 0,
   y\(2\,1\) +2*y\(2\,2\) +3*y\(2\,3\) +4*y\(2\,4\) +5*y\(2\,5\)-x2 = 0,
   y\(3\,1\) +2*y\(3\,2\) +3*y\(3\,3\) +4*y\(3\,4\) +5*y\(3\,5\)-x3 = 0,
   y\(4\,1\) +2*y\(4\,2\) +3*y\(4\,3\) +4*y\(4\,4\) +5*y\(4\,5\)-x4 = 0,
   y\(5\,1\) +2*y\(5\,2\) +3*y\(5\,3\) +4*y\(5\,4\) +5*y\(5\,5\)-x5 = 0,
   y\(6\,1\) +2*y\(6\,2\) +3*y\(6\,3\) +4*y\(6\,4\) +5*y\(6\,5\)-x6 = 0,
    y\(1\,3\) + y\(2\,3\) + y\(3\,3\) + y\(4\,3\) + y\(5\,3\) + y\(6\,3\) >= 4,
  y\(1\,0\) >= 0,
  y\(1\,1\) >= 0,
  y\(1\,2\) >= 0,
  y\(1\,3\) >= 0,
  y\(1\,4\) >= 0,
  y\(1\,5\) >= 0,
  y\(2\,0\) >= 0,
  y\(2\,1\) >= 0,
  y\(2\,2\) >= 0,
  y\(2\,3\) >= 0,
  y\(2\,4\) >= 0,
  y\(2\,5\) >= 0,
  y\(3\,0\) >= 0,
  y\(3\,1\) >= 0,
  y\(3\,2\) >= 0,
  y\(3\,3\) >= 0,
  y\(3\,4\) >= 0,
  y\(3\,5\) >= 0,
  y\(4\,0\) >= 0,
  y\(4\,1\) >= 0,
  y\(4\,2\) >= 0,
  y\(4\,3\) >= 0,
  y\(4\,4\) >= 0,
  y\(4\,5\) >= 0,
  y\(5\,0\) >= 0,
  y\(5\,1\) >= 0,
  y\(5\,2\) >= 0,
  y\(5\,3\) >= 0,
  y\(5\,4\) >= 0,
  y\(5\,5\) >= 0,
  y\(6\,0\) >= 0,
  y\(6\,1\) >= 0,
  y\(6\,2\) >= 0,
  y\(6\,3\) >= 0,
  y\(6\,4\) >= 0,
  y\(6\,5\) >= 0
  ]$

  /* Above: the model in x and y */
  nbx:6;
  /* Eliminate one y variable per equality */
  for i: 1 thru nbx do
    for j: 1 step -1 thru 0 do
      (
      v:second(sort(listofvars(m[1]))),
print(v),
      e:solve(m[1], v),
print("Substitute this in"),
print(e),
      m:ev(m,e),
      m:rest(m),
print(m)
      );

  /* Construct the conic combination of all inequalities left as the objective */
  leftside:0;
  rightside:0;
  lambdas:makelist();
  for i: 1 thru length(m) do
    (
    push(l(i),lambdas),
print("***"),
print(m[i]),
    leftside: leftside + l(i)*lhs(m[i]),
    rightside: rightside + l(i)*rhs(m[i])
  );
  objective: expand(leftside-rightside);
  print(objective);
  vars:sort(listofvars(objective));

  /* Extract the coefficient of each y to set it to zero */
  M:makelist();
  for i: nbx+1 thru length(vars) do
    push(coeff(objective,vars[i],1)=0,M);

  /* Substitute the vanishing equalities into the objective */
  objective:ev(objective,M);
  objective:ratsimp(objective);
  objective:expand(ev(objective,M));
  print(objective);
  /* Print the coefficients of the lambdas. Each one is a polynomial in x */
  lambdas:sort(lambdas);
  %print(lambdas);
  %print(coeff(objective,lambdas[2],1));
  for i: 1 thru length(lambdas) do
  (
    p:coeff(objective,lambdas[i],1),
    c:makelist(),
    push(coeff(p,var[1],0),c),
    for j: nbx thru 1 step -1 do
    (
      push(coeff(p,vars[j],1),c)
      ),
    printf(true,"~a ", c)
    );
  printf(true,"~&");


  /* The default print is ugly. We will make it nicer */
  M:coefmatrix(M,lambdas);
  for i: 1 thru length(M) do
    (
    for j: 1 thru length(M[1]) do 
      printf(true,"~3d",M[i,j]),
    printf(true," = 0 ~&")
  );
  /* The normalizing equality, all lambdas must sum to one */
  for i: 1 thru length(lambdas) do printf(true, "~3d", 1);
  printf(true," = 1~&");
#+END_SRC

#+RESULTS:
:RESULTS:
y(1,1) 
Substitute this in 
[y(1,1) = (- y(1,5)) - y(1,4) - y(1,3) - y(1,2) - y(1,0) + 1] 
[y(2,5) + y(2,4) + y(2,3) + y(2,2) + y(2,1) + y(2,0) = 1, 
y(3,5) + y(3,4) + y(3,3) + y(3,2) + y(3,1) + y(3,0) = 1, 
y(4,5) + y(4,4) + y(4,3) + y(4,2) + y(4,1) + y(4,0) = 1, 
y(5,5) + y(5,4) + y(5,3) + y(5,2) + y(5,1) + y(5,0) = 1, 
y(6,5) + y(6,4) + y(6,3) + y(6,2) + y(6,1) + y(6,0) = 1, 
4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - y(1,0) - x1 + 1 = 0, 
5 y(2,5) + 4 y(2,4) + 3 y(2,3) + 2 y(2,2) + y(2,1) - x2 = 0, 
5 y(3,5) + 4 y(3,4) + 3 y(3,3) + 2 y(3,2) + y(3,1) - x3 = 0, 
5 y(4,5) + 4 y(4,4) + 3 y(4,3) + 2 y(4,2) + y(4,1) - x4 = 0, 
5 y(5,5) + 4 y(5,4) + 3 y(5,3) + 2 y(5,2) + y(5,1) - x5 = 0, 
5 y(6,5) + 4 y(6,4) + 3 y(6,3) + 2 y(6,2) + y(6,1) - x6 = 0, 
y(6,3) + y(5,3) + y(4,3) + y(3,3) + y(2,3) + y(1,3) >= 4, y(1,0) >= 0, 
(- y(1,5)) - y(1,4) - y(1,3) - y(1,2) - y(1,0) + 1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, y(2,0) >= 0, y(2,1) >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, y(3,0) >= 0, y(3,1) >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0, y(4,0) >= 0, y(4,1) >= 0, y(4,2) >= 0, 
y(4,3) >= 0, y(4,4) >= 0, y(4,5) >= 0, y(5,0) >= 0, y(5,1) >= 0, y(5,2) >= 0, 
y(5,3) >= 0, y(5,4) >= 0, y(5,5) >= 0, y(6,0) >= 0, y(6,1) >= 0, y(6,2) >= 0, 
y(6,3) >= 0, y(6,4) >= 0, y(6,5) >= 0] 
y(2,1) 
Substitute this in 
[y(2,1) = (- y(2,5)) - y(2,4) - y(2,3) - y(2,2) - y(2,0) + 1] 
[y(3,5) + y(3,4) + y(3,3) + y(3,2) + y(3,1) + y(3,0) = 1, 
y(4,5) + y(4,4) + y(4,3) + y(4,2) + y(4,1) + y(4,0) = 1, 
y(5,5) + y(5,4) + y(5,3) + y(5,2) + y(5,1) + y(5,0) = 1, 
y(6,5) + y(6,4) + y(6,3) + y(6,2) + y(6,1) + y(6,0) = 1, 
4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - y(1,0) - x1 + 1 = 0, 
4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - y(2,0) - x2 + 1 = 0, 
5 y(3,5) + 4 y(3,4) + 3 y(3,3) + 2 y(3,2) + y(3,1) - x3 = 0, 
5 y(4,5) + 4 y(4,4) + 3 y(4,3) + 2 y(4,2) + y(4,1) - x4 = 0, 
5 y(5,5) + 4 y(5,4) + 3 y(5,3) + 2 y(5,2) + y(5,1) - x5 = 0, 
5 y(6,5) + 4 y(6,4) + 3 y(6,3) + 2 y(6,2) + y(6,1) - x6 = 0, 
y(6,3) + y(5,3) + y(4,3) + y(3,3) + y(2,3) + y(1,3) >= 4, y(1,0) >= 0, 
(- y(1,5)) - y(1,4) - y(1,3) - y(1,2) - y(1,0) + 1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, y(2,0) >= 0, 
(- y(2,5)) - y(2,4) - y(2,3) - y(2,2) - y(2,0) + 1 >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, y(3,0) >= 0, y(3,1) >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0, y(4,0) >= 0, y(4,1) >= 0, y(4,2) >= 0, 
y(4,3) >= 0, y(4,4) >= 0, y(4,5) >= 0, y(5,0) >= 0, y(5,1) >= 0, y(5,2) >= 0, 
y(5,3) >= 0, y(5,4) >= 0, y(5,5) >= 0, y(6,0) >= 0, y(6,1) >= 0, y(6,2) >= 0, 
y(6,3) >= 0, y(6,4) >= 0, y(6,5) >= 0] 
y(3,1) 
Substitute this in 
[y(3,1) = (- y(3,5)) - y(3,4) - y(3,3) - y(3,2) - y(3,0) + 1] 
[y(4,5) + y(4,4) + y(4,3) + y(4,2) + y(4,1) + y(4,0) = 1, 
y(5,5) + y(5,4) + y(5,3) + y(5,2) + y(5,1) + y(5,0) = 1, 
y(6,5) + y(6,4) + y(6,3) + y(6,2) + y(6,1) + y(6,0) = 1, 
4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - y(1,0) - x1 + 1 = 0, 
4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - y(2,0) - x2 + 1 = 0, 
4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) - y(3,0) - x3 + 1 = 0, 
5 y(4,5) + 4 y(4,4) + 3 y(4,3) + 2 y(4,2) + y(4,1) - x4 = 0, 
5 y(5,5) + 4 y(5,4) + 3 y(5,3) + 2 y(5,2) + y(5,1) - x5 = 0, 
5 y(6,5) + 4 y(6,4) + 3 y(6,3) + 2 y(6,2) + y(6,1) - x6 = 0, 
y(6,3) + y(5,3) + y(4,3) + y(3,3) + y(2,3) + y(1,3) >= 4, y(1,0) >= 0, 
(- y(1,5)) - y(1,4) - y(1,3) - y(1,2) - y(1,0) + 1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, y(2,0) >= 0, 
(- y(2,5)) - y(2,4) - y(2,3) - y(2,2) - y(2,0) + 1 >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, y(3,0) >= 0, 
(- y(3,5)) - y(3,4) - y(3,3) - y(3,2) - y(3,0) + 1 >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0, y(4,0) >= 0, y(4,1) >= 0, y(4,2) >= 0, 
y(4,3) >= 0, y(4,4) >= 0, y(4,5) >= 0, y(5,0) >= 0, y(5,1) >= 0, y(5,2) >= 0, 
y(5,3) >= 0, y(5,4) >= 0, y(5,5) >= 0, y(6,0) >= 0, y(6,1) >= 0, y(6,2) >= 0, 
y(6,3) >= 0, y(6,4) >= 0, y(6,5) >= 0] 
y(4,1) 
Substitute this in 
[y(4,1) = (- y(4,5)) - y(4,4) - y(4,3) - y(4,2) - y(4,0) + 1] 
[y(5,5) + y(5,4) + y(5,3) + y(5,2) + y(5,1) + y(5,0) = 1, 
y(6,5) + y(6,4) + y(6,3) + y(6,2) + y(6,1) + y(6,0) = 1, 
4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - y(1,0) - x1 + 1 = 0, 
4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - y(2,0) - x2 + 1 = 0, 
4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) - y(3,0) - x3 + 1 = 0, 
4 y(4,5) + 3 y(4,4) + 2 y(4,3) + y(4,2) - y(4,0) - x4 + 1 = 0, 
5 y(5,5) + 4 y(5,4) + 3 y(5,3) + 2 y(5,2) + y(5,1) - x5 = 0, 
5 y(6,5) + 4 y(6,4) + 3 y(6,3) + 2 y(6,2) + y(6,1) - x6 = 0, 
y(6,3) + y(5,3) + y(4,3) + y(3,3) + y(2,3) + y(1,3) >= 4, y(1,0) >= 0, 
(- y(1,5)) - y(1,4) - y(1,3) - y(1,2) - y(1,0) + 1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, y(2,0) >= 0, 
(- y(2,5)) - y(2,4) - y(2,3) - y(2,2) - y(2,0) + 1 >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, y(3,0) >= 0, 
(- y(3,5)) - y(3,4) - y(3,3) - y(3,2) - y(3,0) + 1 >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0, y(4,0) >= 0, 
(- y(4,5)) - y(4,4) - y(4,3) - y(4,2) - y(4,0) + 1 >= 0, y(4,2) >= 0, 
y(4,3) >= 0, y(4,4) >= 0, y(4,5) >= 0, y(5,0) >= 0, y(5,1) >= 0, y(5,2) >= 0, 
y(5,3) >= 0, y(5,4) >= 0, y(5,5) >= 0, y(6,0) >= 0, y(6,1) >= 0, y(6,2) >= 0, 
y(6,3) >= 0, y(6,4) >= 0, y(6,5) >= 0] 
y(5,1) 
Substitute this in 
[y(5,1) = (- y(5,5)) - y(5,4) - y(5,3) - y(5,2) - y(5,0) + 1] 
[y(6,5) + y(6,4) + y(6,3) + y(6,2) + y(6,1) + y(6,0) = 1, 
4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - y(1,0) - x1 + 1 = 0, 
4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - y(2,0) - x2 + 1 = 0, 
4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) - y(3,0) - x3 + 1 = 0, 
4 y(4,5) + 3 y(4,4) + 2 y(4,3) + y(4,2) - y(4,0) - x4 + 1 = 0, 
4 y(5,5) + 3 y(5,4) + 2 y(5,3) + y(5,2) - y(5,0) - x5 + 1 = 0, 
5 y(6,5) + 4 y(6,4) + 3 y(6,3) + 2 y(6,2) + y(6,1) - x6 = 0, 
y(6,3) + y(5,3) + y(4,3) + y(3,3) + y(2,3) + y(1,3) >= 4, y(1,0) >= 0, 
(- y(1,5)) - y(1,4) - y(1,3) - y(1,2) - y(1,0) + 1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, y(2,0) >= 0, 
(- y(2,5)) - y(2,4) - y(2,3) - y(2,2) - y(2,0) + 1 >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, y(3,0) >= 0, 
(- y(3,5)) - y(3,4) - y(3,3) - y(3,2) - y(3,0) + 1 >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0, y(4,0) >= 0, 
(- y(4,5)) - y(4,4) - y(4,3) - y(4,2) - y(4,0) + 1 >= 0, y(4,2) >= 0, 
y(4,3) >= 0, y(4,4) >= 0, y(4,5) >= 0, y(5,0) >= 0, 
(- y(5,5)) - y(5,4) - y(5,3) - y(5,2) - y(5,0) + 1 >= 0, y(5,2) >= 0, 
y(5,3) >= 0, y(5,4) >= 0, y(5,5) >= 0, y(6,0) >= 0, y(6,1) >= 0, y(6,2) >= 0, 
y(6,3) >= 0, y(6,4) >= 0, y(6,5) >= 0] 
y(6,1) 
Substitute this in 
[y(6,1) = (- y(6,5)) - y(6,4) - y(6,3) - y(6,2) - y(6,0) + 1] 
[4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - y(1,0) - x1 + 1 = 0, 
4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - y(2,0) - x2 + 1 = 0, 
4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) - y(3,0) - x3 + 1 = 0, 
4 y(4,5) + 3 y(4,4) + 2 y(4,3) + y(4,2) - y(4,0) - x4 + 1 = 0, 
4 y(5,5) + 3 y(5,4) + 2 y(5,3) + y(5,2) - y(5,0) - x5 + 1 = 0, 
4 y(6,5) + 3 y(6,4) + 2 y(6,3) + y(6,2) - y(6,0) - x6 + 1 = 0, 
y(6,3) + y(5,3) + y(4,3) + y(3,3) + y(2,3) + y(1,3) >= 4, y(1,0) >= 0, 
(- y(1,5)) - y(1,4) - y(1,3) - y(1,2) - y(1,0) + 1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, y(2,0) >= 0, 
(- y(2,5)) - y(2,4) - y(2,3) - y(2,2) - y(2,0) + 1 >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, y(3,0) >= 0, 
(- y(3,5)) - y(3,4) - y(3,3) - y(3,2) - y(3,0) + 1 >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0, y(4,0) >= 0, 
(- y(4,5)) - y(4,4) - y(4,3) - y(4,2) - y(4,0) + 1 >= 0, y(4,2) >= 0, 
y(4,3) >= 0, y(4,4) >= 0, y(4,5) >= 0, y(5,0) >= 0, 
(- y(5,5)) - y(5,4) - y(5,3) - y(5,2) - y(5,0) + 1 >= 0, y(5,2) >= 0, 
y(5,3) >= 0, y(5,4) >= 0, y(5,5) >= 0, y(6,0) >= 0, 
(- y(6,5)) - y(6,4) - y(6,3) - y(6,2) - y(6,0) + 1 >= 0, y(6,2) >= 0, 
y(6,3) >= 0, y(6,4) >= 0, y(6,5) >= 0] 
y(1,0) 
Substitute this in 
[y(1,0) = 4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - x1 + 1] 
[4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - y(2,0) - x2 + 1 = 0, 
4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) - y(3,0) - x3 + 1 = 0, 
4 y(4,5) + 3 y(4,4) + 2 y(4,3) + y(4,2) - y(4,0) - x4 + 1 = 0, 
4 y(5,5) + 3 y(5,4) + 2 y(5,3) + y(5,2) - y(5,0) - x5 + 1 = 0, 
4 y(6,5) + 3 y(6,4) + 2 y(6,3) + y(6,2) - y(6,0) - x6 + 1 = 0, 
y(6,3) + y(5,3) + y(4,3) + y(3,3) + y(2,3) + y(1,3) >= 4, 
4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - x1 + 1 >= 0, 
(- 5 y(1,5)) - 4 y(1,4) - 3 y(1,3) - 2 y(1,2) + x1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, y(2,0) >= 0, 
(- y(2,5)) - y(2,4) - y(2,3) - y(2,2) - y(2,0) + 1 >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, y(3,0) >= 0, 
(- y(3,5)) - y(3,4) - y(3,3) - y(3,2) - y(3,0) + 1 >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0, y(4,0) >= 0, 
(- y(4,5)) - y(4,4) - y(4,3) - y(4,2) - y(4,0) + 1 >= 0, y(4,2) >= 0, 
y(4,3) >= 0, y(4,4) >= 0, y(4,5) >= 0, y(5,0) >= 0, 
(- y(5,5)) - y(5,4) - y(5,3) - y(5,2) - y(5,0) + 1 >= 0, y(5,2) >= 0, 
y(5,3) >= 0, y(5,4) >= 0, y(5,5) >= 0, y(6,0) >= 0, 
(- y(6,5)) - y(6,4) - y(6,3) - y(6,2) - y(6,0) + 1 >= 0, y(6,2) >= 0, 
y(6,3) >= 0, y(6,4) >= 0, y(6,5) >= 0] 
y(2,0) 
Substitute this in 
[y(2,0) = 4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - x2 + 1] 
[4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) - y(3,0) - x3 + 1 = 0, 
4 y(4,5) + 3 y(4,4) + 2 y(4,3) + y(4,2) - y(4,0) - x4 + 1 = 0, 
4 y(5,5) + 3 y(5,4) + 2 y(5,3) + y(5,2) - y(5,0) - x5 + 1 = 0, 
4 y(6,5) + 3 y(6,4) + 2 y(6,3) + y(6,2) - y(6,0) - x6 + 1 = 0, 
y(6,3) + y(5,3) + y(4,3) + y(3,3) + y(2,3) + y(1,3) >= 4, 
4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - x1 + 1 >= 0, 
(- 5 y(1,5)) - 4 y(1,4) - 3 y(1,3) - 2 y(1,2) + x1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, 
4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - x2 + 1 >= 0, 
(- 5 y(2,5)) - 4 y(2,4) - 3 y(2,3) - 2 y(2,2) + x2 >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, y(3,0) >= 0, 
(- y(3,5)) - y(3,4) - y(3,3) - y(3,2) - y(3,0) + 1 >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0, y(4,0) >= 0, 
(- y(4,5)) - y(4,4) - y(4,3) - y(4,2) - y(4,0) + 1 >= 0, y(4,2) >= 0, 
y(4,3) >= 0, y(4,4) >= 0, y(4,5) >= 0, y(5,0) >= 0, 
(- y(5,5)) - y(5,4) - y(5,3) - y(5,2) - y(5,0) + 1 >= 0, y(5,2) >= 0, 
y(5,3) >= 0, y(5,4) >= 0, y(5,5) >= 0, y(6,0) >= 0, 
(- y(6,5)) - y(6,4) - y(6,3) - y(6,2) - y(6,0) + 1 >= 0, y(6,2) >= 0, 
y(6,3) >= 0, y(6,4) >= 0, y(6,5) >= 0] 
y(3,0) 
Substitute this in 
[y(3,0) = 4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) - x3 + 1] 
[4 y(4,5) + 3 y(4,4) + 2 y(4,3) + y(4,2) - y(4,0) - x4 + 1 = 0, 
4 y(5,5) + 3 y(5,4) + 2 y(5,3) + y(5,2) - y(5,0) - x5 + 1 = 0, 
4 y(6,5) + 3 y(6,4) + 2 y(6,3) + y(6,2) - y(6,0) - x6 + 1 = 0, 
y(6,3) + y(5,3) + y(4,3) + y(3,3) + y(2,3) + y(1,3) >= 4, 
4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - x1 + 1 >= 0, 
(- 5 y(1,5)) - 4 y(1,4) - 3 y(1,3) - 2 y(1,2) + x1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, 
4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - x2 + 1 >= 0, 
(- 5 y(2,5)) - 4 y(2,4) - 3 y(2,3) - 2 y(2,2) + x2 >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, 
4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) - x3 + 1 >= 0, 
(- 5 y(3,5)) - 4 y(3,4) - 3 y(3,3) - 2 y(3,2) + x3 >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0, y(4,0) >= 0, 
(- y(4,5)) - y(4,4) - y(4,3) - y(4,2) - y(4,0) + 1 >= 0, y(4,2) >= 0, 
y(4,3) >= 0, y(4,4) >= 0, y(4,5) >= 0, y(5,0) >= 0, 
(- y(5,5)) - y(5,4) - y(5,3) - y(5,2) - y(5,0) + 1 >= 0, y(5,2) >= 0, 
y(5,3) >= 0, y(5,4) >= 0, y(5,5) >= 0, y(6,0) >= 0, 
(- y(6,5)) - y(6,4) - y(6,3) - y(6,2) - y(6,0) + 1 >= 0, y(6,2) >= 0, 
y(6,3) >= 0, y(6,4) >= 0, y(6,5) >= 0] 
y(4,0) 
Substitute this in 
[y(4,0) = 4 y(4,5) + 3 y(4,4) + 2 y(4,3) + y(4,2) - x4 + 1] 
[4 y(5,5) + 3 y(5,4) + 2 y(5,3) + y(5,2) - y(5,0) - x5 + 1 = 0, 
4 y(6,5) + 3 y(6,4) + 2 y(6,3) + y(6,2) - y(6,0) - x6 + 1 = 0, 
y(6,3) + y(5,3) + y(4,3) + y(3,3) + y(2,3) + y(1,3) >= 4, 
4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - x1 + 1 >= 0, 
(- 5 y(1,5)) - 4 y(1,4) - 3 y(1,3) - 2 y(1,2) + x1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, 
4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - x2 + 1 >= 0, 
(- 5 y(2,5)) - 4 y(2,4) - 3 y(2,3) - 2 y(2,2) + x2 >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, 
4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) - x3 + 1 >= 0, 
(- 5 y(3,5)) - 4 y(3,4) - 3 y(3,3) - 2 y(3,2) + x3 >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0, 
4 y(4,5) + 3 y(4,4) + 2 y(4,3) + y(4,2) - x4 + 1 >= 0, 
(- 5 y(4,5)) - 4 y(4,4) - 3 y(4,3) - 2 y(4,2) + x4 >= 0, y(4,2) >= 0, 
y(4,3) >= 0, y(4,4) >= 0, y(4,5) >= 0, y(5,0) >= 0, 
(- y(5,5)) - y(5,4) - y(5,3) - y(5,2) - y(5,0) + 1 >= 0, y(5,2) >= 0, 
y(5,3) >= 0, y(5,4) >= 0, y(5,5) >= 0, y(6,0) >= 0, 
(- y(6,5)) - y(6,4) - y(6,3) - y(6,2) - y(6,0) + 1 >= 0, y(6,2) >= 0, 
y(6,3) >= 0, y(6,4) >= 0, y(6,5) >= 0] 
y(5,0) 
Substitute this in 
[y(5,0) = 4 y(5,5) + 3 y(5,4) + 2 y(5,3) + y(5,2) - x5 + 1] 
[4 y(6,5) + 3 y(6,4) + 2 y(6,3) + y(6,2) - y(6,0) - x6 + 1 = 0, 
y(6,3) + y(5,3) + y(4,3) + y(3,3) + y(2,3) + y(1,3) >= 4, 
4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - x1 + 1 >= 0, 
(- 5 y(1,5)) - 4 y(1,4) - 3 y(1,3) - 2 y(1,2) + x1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, 
4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - x2 + 1 >= 0, 
(- 5 y(2,5)) - 4 y(2,4) - 3 y(2,3) - 2 y(2,2) + x2 >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, 
4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) - x3 + 1 >= 0, 
(- 5 y(3,5)) - 4 y(3,4) - 3 y(3,3) - 2 y(3,2) + x3 >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0, 
4 y(4,5) + 3 y(4,4) + 2 y(4,3) + y(4,2) - x4 + 1 >= 0, 
(- 5 y(4,5)) - 4 y(4,4) - 3 y(4,3) - 2 y(4,2) + x4 >= 0, y(4,2) >= 0, 
y(4,3) >= 0, y(4,4) >= 0, y(4,5) >= 0, 
4 y(5,5) + 3 y(5,4) + 2 y(5,3) + y(5,2) - x5 + 1 >= 0, 
(- 5 y(5,5)) - 4 y(5,4) - 3 y(5,3) - 2 y(5,2) + x5 >= 0, y(5,2) >= 0, 
y(5,3) >= 0, y(5,4) >= 0, y(5,5) >= 0, y(6,0) >= 0, 
(- y(6,5)) - y(6,4) - y(6,3) - y(6,2) - y(6,0) + 1 >= 0, y(6,2) >= 0, 
y(6,3) >= 0, y(6,4) >= 0, y(6,5) >= 0] 
y(6,0) 
Substitute this in 
[y(6,0) = 4 y(6,5) + 3 y(6,4) + 2 y(6,3) + y(6,2) - x6 + 1] 
[y(6,3) + y(5,3) + y(4,3) + y(3,3) + y(2,3) + y(1,3) >= 4, 
4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - x1 + 1 >= 0, 
(- 5 y(1,5)) - 4 y(1,4) - 3 y(1,3) - 2 y(1,2) + x1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, 
4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - x2 + 1 >= 0, 
(- 5 y(2,5)) - 4 y(2,4) - 3 y(2,3) - 2 y(2,2) + x2 >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, 
4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) - x3 + 1 >= 0, 
(- 5 y(3,5)) - 4 y(3,4) - 3 y(3,3) - 2 y(3,2) + x3 >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0, 
4 y(4,5) + 3 y(4,4) + 2 y(4,3) + y(4,2) - x4 + 1 >= 0, 
(- 5 y(4,5)) - 4 y(4,4) - 3 y(4,3) - 2 y(4,2) + x4 >= 0, y(4,2) >= 0, 
y(4,3) >= 0, y(4,4) >= 0, y(4,5) >= 0, 
4 y(5,5) + 3 y(5,4) + 2 y(5,3) + y(5,2) - x5 + 1 >= 0, 
(- 5 y(5,5)) - 4 y(5,4) - 3 y(5,3) - 2 y(5,2) + x5 >= 0, y(5,2) >= 0, 
y(5,3) >= 0, y(5,4) >= 0, y(5,5) >= 0, 
4 y(6,5) + 3 y(6,4) + 2 y(6,3) + y(6,2) - x6 + 1 >= 0, 
(- 5 y(6,5)) - 4 y(6,4) - 3 y(6,3) - 2 y(6,2) + x6 >= 0, y(6,2) >= 0, 
y(6,3) >= 0, y(6,4) >= 0, y(6,5) >= 0] 
** Step 1, clean up the above.
#+BEGIN_SRC maxima :tangle "prep.mac" :results raw replace drawer

#+END_SRC

#+RESULTS:
:RESULTS:
:END:
